app/views/posts/_post.html.erb

    <small>
      <%= link_to("#{post.comments.size} comments", post_path(post)) %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]