app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'test-post-on-mac' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "First comment\r\n"], ["created_at", Mon, 24 Aug 2015 20:39:34 UTC +00:00], ["post_id", 3], ["updated_at", Mon, 24 Aug 2015 20:39:34 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = Post.find_by slug: params[:post_id]
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 24 Aug 2015 20:50:02 UTC +00:00], ["updated_at", Mon, 24 Aug 2015 20:50:02 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])