app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.limit(Post::PER_PAGE).offset(params[:offset])

INSERT INTO "posts" ("created_at", "description", "slug", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 24 Aug 2015 18:55:26 UTC +00:00], ["updated_at", Mon, 24 Aug 2015 18:55:26 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'test-post-on-mac' LIMIT 1
---
  def set_post
    @post = Post.find_by slug: params[:id]