app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "slug", "time_zone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "password_digest" = ?, "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$ia3q2CiW5PKd4u9rNj5LkOy02gBhzhwckY0dSvXNc.02ULiouQtSi"], ["time_zone", "Alaska"], ["updated_at", Tue, 01 Sep 2015 14:12:32 CDT -05:00]]
---
  def update
    if @user.update(user_params)